[
    {
      "id": 1,
      "name": "DSA (Data Structures & Algorithms)",
      "image": "https://cdn-icons-png.flaticon.com/512/2721/2721292.png",
      "summary": "Mastering problem-solving with optimized data structures and algorithms.",
      "longSummary": "Data Structures and Algorithms (DSA) are fundamental concepts in computer science that help in efficient data organization and manipulation. Mastering DSA enables programmers to solve complex problems more effectively, improving performance and resource management.",
      "documentation": "https://www.geeksforgeeks.org/data-structures/",
      "detailedImage": "https://media.geeksforgeeks.org/wp-content/uploads/20230819113602/dsa-by-sandeep-jain.png",
      "benefits": "Improves problem-solving skills, enhances coding efficiency, and prepares for technical interviews.",
      "howToStart": "Begin with basic data structures like arrays and linked lists, then progress to more complex structures.",
      "whyLearn": "Essential for writing efficient algorithms and for excelling in competitive programming and interviews.",
      "subTopics": ["Arrays", "Linked Lists", "Stacks", "Queues", "Trees", "Graphs", "Sorting Algorithms"]
    },
    {
      "id": 2,
      "name": "C++",
      "image": "https://cdn-icons-png.flaticon.com/512/6132/6132222.png",
      "summary": "High-performance programming with OOP concepts and STL.",
      "longSummary": "C++ is a powerful general-purpose programming language that supports procedural, object-oriented, and generic programming. It is widely used in software development, system/software applications, and game development due to its performance and efficiency.",
      "documentation": "https://cplusplus.com/doc/tutorial/",
      "detailedImage": "https://www.simplilearn.com/ice9/free_resources_article_thumb/What_is_CPP.jpg",
      "benefits": "Offers control over system resources, is widely used in game development and systems programming.",
      "howToStart": "Install a C++ compiler, start with basic syntax and structures, then move to advanced features like OOP.",
      "whyLearn": "A foundational language that enhances understanding of programming concepts and system-level programming.",
      "subTopics": ["Variables", "Control Structures", "Functions", "Classes and Objects", "Templates"]
    },
    {
      "id": 3,
      "name": "Java",
      "image": "https://cdn-icons-png.flaticon.com/512/226/226777.png",
      "summary": "Object-oriented programming for cross-platform applications.",
      "longSummary": "Java is an object-oriented programming language that is designed to have as few implementation dependencies as possible. It allows developers to write applications that can run on any system that supports Java without needing recompilation.",
      "documentation": "https://docs.oracle.com/javase/tutorial/",
      "detailedImage": "https://www.mytaskpanel.com/wp-content/uploads/2023/04/consulting-blog-09.webp",
      "benefits": "Platform independence, extensive libraries, and strong community support.",
      "howToStart": "Install the Java Development Kit (JDK), set up an IDE, and start with basic Java syntax.",
      "whyLearn": "Java is used in many enterprise applications, Android development, and large systems.",
      "subTopics": ["Basic Syntax", "Control Flow", "OOP Concepts", "Exception Handling", "Collections Framework"]
    },
    {
      "id": 4,
      "name": "HTML & CSS",
      "image": "https://cdn-icons-png.flaticon.com/512/732/732190.png",
      "summary": "Building responsive websites with structure and style.",
      "longSummary": "HTML (HyperText Markup Language) and CSS (Cascading Style Sheets) are the foundational technologies for creating web pages. HTML provides the structure, while CSS is used for presentation and layout, allowing for the design of visually appealing websites.",
      "documentation": "https://developer.mozilla.org/en-US/docs/Web/HTML",
      "detailedImage": "https://www.pngitem.com/pimgs/m/391-3917813_html-css-icon-html-css-logo-png-transparent.png",
      "benefits": "Essential for web development, provides the foundation for front-end technologies.",
      "howToStart": "Use a simple text editor to write HTML and CSS, and open the files in a web browser to view results.",
      "whyLearn": "Understanding HTML and CSS is crucial for any web developer, as they form the backbone of web pages.",
      "subTopics": ["HTML Elements", "CSS Selectors", "Box Model", "Flexbox", "Responsive Design"]
    },
    {
      "id": 5,
      "name": "JavaScript",
      "image": "https://cdn-icons-png.flaticon.com/512/919/919828.png",
      "summary": "Interactive web features using Vanilla JS and ES6+.",
      "longSummary": "JavaScript is a high-level, dynamic, and interpreted programming language that is widely used for creating interactive effects within web browsers. It enables developers to implement complex features on web pages, enhancing user experience.",
      "documentation": "https://developer.mozilla.org/en-US/docs/Web/JavaScript",
      "detailedImage": "https://images.prismic.io/turing/652ebc99fbd9a45bcec8182d_Best_Online_Resources_to_Learn_Java_Script_for_Free_29680a8105.webp?auto=format,compress",
      "benefits": "Enhances user experience, allows for dynamic content, and is essential for modern web development.",
      "howToStart": "Start with basic scripts in your HTML files, then explore frameworks like React or Angular.",
      "whyLearn": "It's the backbone of web development and vital for building interactive and responsive websites.",
      "subTopics": ["Variables", "Functions", "DOM Manipulation", "Event Handling", "ES6 Features"]
    },
    {
      "id": 6,
      "name": "React",
      "image": "https://cdn-icons-png.flaticon.com/512/919/919851.png",
      "summary": "Component-based UI building with state management.",
      "longSummary": "React is a JavaScript library for building user interfaces, primarily for single-page applications. It allows developers to create large web applications that can change data without reloading the page, enhancing performance and user experience.",
      "documentation": "https://reactjs.org/docs/getting-started.html",
      "detailedImage": "https://miro.medium.com/v2/resize:fit:1200/0*Bs43h1reQ0NZ2C91.png",
      "benefits": "Promotes reusable components, improves performance with virtual DOM, and has a large ecosystem.",
      "howToStart": "Set up a development environment with Node.js and npm, then create a new React app using Create React App.",
      "whyLearn": "React is widely used in the industry, making it a valuable skill for web developers.",
      "subTopics": ["Components", "State and Props", "Lifecycle Methods", "Hooks", "Routing"]
    },
    {
      "id": 7,
      "name": "MongoDB",
      "image": "https://cdn.iconscout.com/icon/free/png-256/mongodb-3521676-2945120.png",
      "summary": "NoSQL database for flexible and scalable apps.",
      "longSummary": "MongoDB is a document-oriented NoSQL database that allows for flexible data storage and retrieval. It is designed for scalability and performance, making it suitable for applications with diverse and dynamic data structures.",
      "documentation": "https://www.mongodb.com/docs/",
      "detailedImage": "https://www.openlogic.com/sites/default/files/image/2021-06/image-blog-openlogic-what-is-mongodb.png",
      "benefits": "Flexible schema design, easy scalability, and powerful querying capabilities.",
      "howToStart": "Install MongoDB locally or use a cloud service, then start by creating databases and collections.",
      "whyLearn": "Essential for modern web development, especially in full-stack applications.",
      "subTopics": ["CRUD Operations", "Data Modeling", "Indexes", "Aggregation", "Mongoose"]
    },
    {
      "id": 8,
      "name": "Node.js",
      "image": "https://miro.medium.com/v2/resize:fit:900/1*TY9uBBO9leUbRtlXmQBiug.png",
      "summary": "Back-end JavaScript for creating scalable server-side apps.",
      "longSummary": "Node.js is an open-source, cross-platform JavaScript runtime environment that executes JavaScript code outside a web browser. It is used for building scalable network applications and real-time web services.",
      "documentation": "https://nodejs.org/en/docs/",
      "detailedImage": "https://images.ctfassets.net/aq13lwl6616q/7cS8gBoWulxkWNWEm0FspJ/c7eb42dd82e27279307f8b9fc9b136fa/nodejs_cover_photo_smaller_size.png",
      "benefits": "Non-blocking I/O model, high performance, and the ability to handle multiple connections simultaneously.",
      "howToStart": "Install Node.js, create a simple server, and start building RESTful APIs.",
      "whyLearn": "Key technology for server-side development and building full-stack applications.",
      "subTopics": ["Modules", "Asynchronous Programming", "Express.js", "APIs", "Middleware"]
    },
    {
      "id": 9,
      "name": "EJS",
      "image": "https://static-00.iconduck.com/assets.00/file-type-ejs-icon-2048x1151-hdkbavbz.png",
      "summary": "Dynamic HTML rendering with embedded JavaScript.",
      "longSummary": "EJS (Embedded JavaScript) is a simple templating language that lets you generate HTML markup with plain JavaScript. It is easy to use and integrates well with Node.js applications, allowing for dynamic content rendering.",
      "documentation": "https://ejs.co/#docs",
      "detailedImage": "https://miro.medium.com/v2/resize:fit:720/1*DG4VA127mu4Fx2TrRIzskw.jpeg",
      "benefits": "Easy to learn, integrates well with Node.js, and simplifies the rendering of dynamic HTML.",
      "howToStart": "Install EJS via npm, set up views and templates in your Node.js application.",
      "whyLearn": "Helpful for developers working with Node.js to create dynamic web pages.",
      "subTopics": ["Templates", "Rendering", "Layout", "Partials", "Middleware Integration"]
    },
    {
      "id": 10,
      "name": "SQL",
      "image": "https://cdn-icons-png.flaticon.com/512/2772/2772128.png",
      "summary": "Database querying for structured data management.",
      "longSummary": "SQL (Structured Query Language) is a standardized programming language used to manage and manipulate relational databases. It allows users to create, read, update, and delete database records effectively.",
      "documentation": "https://www.w3schools.com/sql/",
      "detailedImage": "https://miro.medium.com/v2/resize:fit:1200/1*MaEmNa5X1tR4XQP6VyKZ7g.png",
      "benefits": "Powerful querying capabilities, data integrity, and strong support for transactions.",
      "howToStart": "Install a database like MySQL or PostgreSQL and start writing basic queries.",
      "whyLearn": "SQL skills are in high demand for data management roles and essential for backend development.",
      "subTopics": ["Basic Queries", "Joins", "Subqueries", "Indexes", "Transactions"]
    },
    {
      "id": 11,
      "name": "Communication Skills",
      "image": "https://cdn-icons-png.flaticon.com/512/727/727393.png",
      "summary": "Clear, concise communication for effective teamwork.",
      "longSummary": "Effective communication skills are essential in any professional setting. They involve the ability to convey ideas clearly, listen actively, and engage with team members to foster collaboration and understanding.",
      "documentation": "/communication",
      "detailedImage": "https://www.thebalancemoney.com/thmb/mp-WRJBs_fry0YhoayDf9fc4dFM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/communication-skills-list-2063779_FINAL1-5b60d4a9c9e77c00251d3de9.png",
      "benefits": "Enhances teamwork, improves relationships, and facilitates better project outcomes.",
      "howToStart": "Practice active listening, participate in group discussions, and seek feedback.",
      "whyLearn": "Crucial for career advancement and effective collaboration in any field.",
      "subTopics": ["Active Listening", "Verbal Communication", "Non-Verbal Communication", "Presentation Skills"]
    },
    {
      "id": 12,
      "name": "Organizational Skills",
      "image": "https://cdn-icons-png.flaticon.com/512/679/679960.png",
      "summary": "Efficient task management to meet deadlines and goals.",
      "longSummary": "Organizational skills are the abilities to plan, prioritize, and execute tasks effectively. These skills help individuals manage their time efficiently and maintain productivity in both personal and professional life.",
      "documentation": "/organizational",
      "detailedImage": "https://cdn.prod.website-files.com/62fcfcf2e1a4c21ed18b80e6/64ac8d6bd6acbd789f6e21f7_organizational_skill_types_h4p3.png",
      "benefits": "Improves productivity, reduces stress, and helps in meeting deadlines.",
      "howToStart": "Use tools like calendars, task lists, and project management software to organize tasks.",
      "whyLearn": "Essential for career success and maintaining a balanced workload.",
      "subTopics": ["Time Management", "Task Prioritization", "Goal Setting", "Productivity Tools"]
    }
  ]
  